grevaillot/svd_tools/headers/STM32H742x/ethernet_mac.h
#pragma once 

/* --- Ethernet_MAC: Ethernet: media access control (MAC) ----------- */

/** @defgroup ethernet_mac_registers Ethernet: media access control (MAC) Register
@{*/

/** Ethernet_MAC_MACCR Operating mode configuration register **/
#define Ethernet_MAC_MACCR			MMIO32(Ethernet_MAC_BASE + 0x00)
/** Ethernet_MAC_MACECR Extended operating mode configuration register **/
#define Ethernet_MAC_MACECR			MMIO32(Ethernet_MAC_BASE + 0x04)
/** Ethernet_MAC_MACPFR Packet filtering control register **/
#define Ethernet_MAC_MACPFR			MMIO32(Ethernet_MAC_BASE + 0x08)
/** Ethernet_MAC_MACWTR Watchdog timeout register **/
#define Ethernet_MAC_MACWTR			MMIO32(Ethernet_MAC_BASE + 0x0c)
/** Ethernet_MAC_MACHT0R Hash Table 0 register **/
#define Ethernet_MAC_MACHT0R			MMIO32(Ethernet_MAC_BASE + 0x10)
/** Ethernet_MAC_MACHT1R Hash Table 1 register **/
#define Ethernet_MAC_MACHT1R			MMIO32(Ethernet_MAC_BASE + 0x14)
/** Ethernet_MAC_MACVTR VLAN tag register **/
#define Ethernet_MAC_MACVTR			MMIO32(Ethernet_MAC_BASE + 0x50)
/** Ethernet_MAC_MACVHTR VLAN Hash table register **/
#define Ethernet_MAC_MACVHTR			MMIO32(Ethernet_MAC_BASE + 0x58)
/** Ethernet_MAC_MACVIR VLAN inclusion register **/
#define Ethernet_MAC_MACVIR			MMIO32(Ethernet_MAC_BASE + 0x60)
/** Ethernet_MAC_MACIVIR Inner VLAN inclusion register **/
#define Ethernet_MAC_MACIVIR			MMIO32(Ethernet_MAC_BASE + 0x64)
/** Ethernet_MAC_MACQTxFCR Tx Queue flow control register **/
#define Ethernet_MAC_MACQTxFCR			MMIO32(Ethernet_MAC_BASE + 0x70)
/** Ethernet_MAC_MACRxFCR Rx flow control register **/
#define Ethernet_MAC_MACRxFCR			MMIO32(Ethernet_MAC_BASE + 0x90)
/** Ethernet_MAC_MACISR Interrupt status register **/
#define Ethernet_MAC_MACISR			MMIO32(Ethernet_MAC_BASE + 0xb0)
/** Ethernet_MAC_MACIER Interrupt enable register **/
#define Ethernet_MAC_MACIER			MMIO32(Ethernet_MAC_BASE + 0xb4)
/** Ethernet_MAC_MACRxTxSR Rx Tx status register **/
#define Ethernet_MAC_MACRxTxSR			MMIO32(Ethernet_MAC_BASE + 0xb8)
/** Ethernet_MAC_MACPCSR PMT control status register **/
#define Ethernet_MAC_MACPCSR			MMIO32(Ethernet_MAC_BASE + 0xc0)
/** Ethernet_MAC_MACRWKPFR Remove wakeup packet filter register **/
#define Ethernet_MAC_MACRWKPFR			MMIO32(Ethernet_MAC_BASE + 0xc4)
/** Ethernet_MAC_MACLCSR LPI control status register **/
#define Ethernet_MAC_MACLCSR			MMIO32(Ethernet_MAC_BASE + 0xd0)
/** Ethernet_MAC_MACLTCR LPI timers control register **/
#define Ethernet_MAC_MACLTCR			MMIO32(Ethernet_MAC_BASE + 0xd4)
/** Ethernet_MAC_MACLETR LPI entry timer register **/
#define Ethernet_MAC_MACLETR			MMIO32(Ethernet_MAC_BASE + 0xd8)
/** Ethernet_MAC_MAC1USTCR 1-microsecond-tick counter register **/
#define Ethernet_MAC_MAC1USTCR			MMIO32(Ethernet_MAC_BASE + 0xdc)
/** Ethernet_MAC_MACVR Version register **/
#define Ethernet_MAC_MACVR			MMIO32(Ethernet_MAC_BASE + 0x110)
/** Ethernet_MAC_MACDR Debug register **/
#define Ethernet_MAC_MACDR			MMIO32(Ethernet_MAC_BASE + 0x114)
/** Ethernet_MAC_MACHWF1R HW feature 1 register **/
#define Ethernet_MAC_MACHWF1R			MMIO32(Ethernet_MAC_BASE + 0x120)
/** Ethernet_MAC_MACHWF2R HW feature 2 register **/
#define Ethernet_MAC_MACHWF2R			MMIO32(Ethernet_MAC_BASE + 0x124)
/** Ethernet_MAC_MACMDIOAR MDIO address register **/
#define Ethernet_MAC_MACMDIOAR			MMIO32(Ethernet_MAC_BASE + 0x200)
/** Ethernet_MAC_MACMDIODR MDIO data register **/
#define Ethernet_MAC_MACMDIODR			MMIO32(Ethernet_MAC_BASE + 0x204)
/** Ethernet_MAC_MACA0HR Address 0 high register **/
#define Ethernet_MAC_MACA0HR			MMIO32(Ethernet_MAC_BASE + 0x300)
/** Ethernet_MAC_MACA0LR Address 0 low register **/
#define Ethernet_MAC_MACA0LR			MMIO32(Ethernet_MAC_BASE + 0x304)
/** Ethernet_MAC_MACA1HR Address 1 high register **/
#define Ethernet_MAC_MACA1HR			MMIO32(Ethernet_MAC_BASE + 0x308)
/** Ethernet_MAC_MACA1LR Address 1 low register **/
#define Ethernet_MAC_MACA1LR			MMIO32(Ethernet_MAC_BASE + 0x30c)
/** Ethernet_MAC_MACA2HR Address 2 high register **/
#define Ethernet_MAC_MACA2HR			MMIO32(Ethernet_MAC_BASE + 0x310)
/** Ethernet_MAC_MACA2LR Address 2 low register **/
#define Ethernet_MAC_MACA2LR			MMIO32(Ethernet_MAC_BASE + 0x314)
/** Ethernet_MAC_MACA3HR Address 3 high register **/
#define Ethernet_MAC_MACA3HR			MMIO32(Ethernet_MAC_BASE + 0x318)
/** Ethernet_MAC_MACA3LR Address 3 low register **/
#define Ethernet_MAC_MACA3LR			MMIO32(Ethernet_MAC_BASE + 0x31c)
/** Ethernet_MAC_MMC_CONTROL MMC control register **/
#define Ethernet_MAC_MMC_CONTROL			MMIO32(Ethernet_MAC_BASE + 0x700)
/** Ethernet_MAC_MMC_RX_INTERRUPT MMC Rx interrupt register **/
#define Ethernet_MAC_MMC_RX_INTERRUPT			MMIO32(Ethernet_MAC_BASE + 0x704)
/** Ethernet_MAC_MMC_TX_INTERRUPT MMC Tx interrupt register **/
#define Ethernet_MAC_MMC_TX_INTERRUPT			MMIO32(Ethernet_MAC_BASE + 0x708)
/** Ethernet_MAC_MMC_RX_INTERRUPT_MASK MMC Rx interrupt mask register **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK			MMIO32(Ethernet_MAC_BASE + 0x70c)
/** Ethernet_MAC_MMC_TX_INTERRUPT_MASK MMC Tx interrupt mask register **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK			MMIO32(Ethernet_MAC_BASE + 0x710)
/** Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS Tx single collision good packets register **/
#define Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS			MMIO32(Ethernet_MAC_BASE + 0x74c)
/** Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS Tx multiple collision good packets register **/
#define Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS			MMIO32(Ethernet_MAC_BASE + 0x750)
/** Ethernet_MAC_TX_PACKET_COUNT_GOOD Tx packet count good register **/
#define Ethernet_MAC_TX_PACKET_COUNT_GOOD			MMIO32(Ethernet_MAC_BASE + 0x768)
/** Ethernet_MAC_RX_CRC_ERROR_PACKETS Rx CRC error packets register **/
#define Ethernet_MAC_RX_CRC_ERROR_PACKETS			MMIO32(Ethernet_MAC_BASE + 0x794)
/** Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS Rx alignment error packets register **/
#define Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS			MMIO32(Ethernet_MAC_BASE + 0x798)
/** Ethernet_MAC_RX_UNICAST_PACKETS_GOOD Rx unicast packets good register **/
#define Ethernet_MAC_RX_UNICAST_PACKETS_GOOD			MMIO32(Ethernet_MAC_BASE + 0x7c4)
/** Ethernet_MAC_TX_LPI_USEC_CNTR Tx LPI microsecond timer register **/
#define Ethernet_MAC_TX_LPI_USEC_CNTR			MMIO32(Ethernet_MAC_BASE + 0x7ec)
/** Ethernet_MAC_TX_LPI_TRAN_CNTR Tx LPI transition counter register **/
#define Ethernet_MAC_TX_LPI_TRAN_CNTR			MMIO32(Ethernet_MAC_BASE + 0x7f0)
/** Ethernet_MAC_RX_LPI_USEC_CNTR Rx LPI microsecond counter register **/
#define Ethernet_MAC_RX_LPI_USEC_CNTR			MMIO32(Ethernet_MAC_BASE + 0x7f4)
/** Ethernet_MAC_RX_LPI_TRAN_CNTR Rx LPI transition counter register **/
#define Ethernet_MAC_RX_LPI_TRAN_CNTR			MMIO32(Ethernet_MAC_BASE + 0x7f8)
/** Ethernet_MAC_MACL3L4C0R L3 and L4 control 0 register **/
#define Ethernet_MAC_MACL3L4C0R			MMIO32(Ethernet_MAC_BASE + 0x900)
/** Ethernet_MAC_MACL4A0R Layer4 address filter 0 register **/
#define Ethernet_MAC_MACL4A0R			MMIO32(Ethernet_MAC_BASE + 0x904)
/** Ethernet_MAC_MACL3A00R MACL3A00R **/
#define Ethernet_MAC_MACL3A00R			MMIO32(Ethernet_MAC_BASE + 0x910)
/** Ethernet_MAC_MACL3A10R Layer3 address 1 filter 0 register **/
#define Ethernet_MAC_MACL3A10R			MMIO32(Ethernet_MAC_BASE + 0x914)
/** Ethernet_MAC_MACL3A20 Layer3 Address 2 filter 0 register **/
#define Ethernet_MAC_MACL3A20			MMIO32(Ethernet_MAC_BASE + 0x918)
/** Ethernet_MAC_MACL3A30 Layer3 Address 3 filter 0 register **/
#define Ethernet_MAC_MACL3A30			MMIO32(Ethernet_MAC_BASE + 0x91c)
/** Ethernet_MAC_MACL3L4C1R L3 and L4 control 1 register **/
#define Ethernet_MAC_MACL3L4C1R			MMIO32(Ethernet_MAC_BASE + 0x930)
/** Ethernet_MAC_MACL4A1R Layer 4 address filter 1 register **/
#define Ethernet_MAC_MACL4A1R			MMIO32(Ethernet_MAC_BASE + 0x934)
/** Ethernet_MAC_MACL3A01R Layer3 address 0 filter 1 Register **/
#define Ethernet_MAC_MACL3A01R			MMIO32(Ethernet_MAC_BASE + 0x940)
/** Ethernet_MAC_MACL3A11R Layer3 address 1 filter 1 register **/
#define Ethernet_MAC_MACL3A11R			MMIO32(Ethernet_MAC_BASE + 0x944)
/** Ethernet_MAC_MACL3A21R Layer3 address 2 filter 1 Register **/
#define Ethernet_MAC_MACL3A21R			MMIO32(Ethernet_MAC_BASE + 0x948)
/** Ethernet_MAC_MACL3A31R Layer3 address 3 filter 1 register **/
#define Ethernet_MAC_MACL3A31R			MMIO32(Ethernet_MAC_BASE + 0x94c)
/** Ethernet_MAC_MACARPAR ARP address register **/
#define Ethernet_MAC_MACARPAR			MMIO32(Ethernet_MAC_BASE + 0xae0)
/** Ethernet_MAC_MACTSCR Timestamp control Register **/
#define Ethernet_MAC_MACTSCR			MMIO32(Ethernet_MAC_BASE + 0xb00)
/** Ethernet_MAC_MACSSIR Sub-second increment register **/
#define Ethernet_MAC_MACSSIR			MMIO32(Ethernet_MAC_BASE + 0xb04)
/** Ethernet_MAC_MACSTSR System time seconds register **/
#define Ethernet_MAC_MACSTSR			MMIO32(Ethernet_MAC_BASE + 0xb08)
/** Ethernet_MAC_MACSTNR System time nanoseconds register **/
#define Ethernet_MAC_MACSTNR			MMIO32(Ethernet_MAC_BASE + 0xb0c)
/** Ethernet_MAC_MACSTSUR System time seconds update register **/
#define Ethernet_MAC_MACSTSUR			MMIO32(Ethernet_MAC_BASE + 0xb10)
/** Ethernet_MAC_MACSTNUR System time nanoseconds update register **/
#define Ethernet_MAC_MACSTNUR			MMIO32(Ethernet_MAC_BASE + 0xb14)
/** Ethernet_MAC_MACTSAR Timestamp addend register **/
#define Ethernet_MAC_MACTSAR			MMIO32(Ethernet_MAC_BASE + 0xb18)
/** Ethernet_MAC_MACTSSR Timestamp status register **/
#define Ethernet_MAC_MACTSSR			MMIO32(Ethernet_MAC_BASE + 0xb20)
/** Ethernet_MAC_MACTxTSSNR Tx timestamp status nanoseconds register **/
#define Ethernet_MAC_MACTxTSSNR			MMIO32(Ethernet_MAC_BASE + 0xb30)
/** Ethernet_MAC_MACTxTSSSR Tx timestamp status seconds register **/
#define Ethernet_MAC_MACTxTSSSR			MMIO32(Ethernet_MAC_BASE + 0xb34)
/** Ethernet_MAC_MACACR Auxiliary control register **/
#define Ethernet_MAC_MACACR			MMIO32(Ethernet_MAC_BASE + 0xb40)
/** Ethernet_MAC_MACATSNR Auxiliary timestamp nanoseconds register **/
#define Ethernet_MAC_MACATSNR			MMIO32(Ethernet_MAC_BASE + 0xb48)
/** Ethernet_MAC_MACATSSR Auxiliary timestamp seconds register **/
#define Ethernet_MAC_MACATSSR			MMIO32(Ethernet_MAC_BASE + 0xb4c)
/** Ethernet_MAC_MACTSIACR Timestamp Ingress asymmetric correction register **/
#define Ethernet_MAC_MACTSIACR			MMIO32(Ethernet_MAC_BASE + 0xb50)
/** Ethernet_MAC_MACTSEACR Timestamp Egress asymmetric correction register **/
#define Ethernet_MAC_MACTSEACR			MMIO32(Ethernet_MAC_BASE + 0xb54)
/** Ethernet_MAC_MACTSICNR Timestamp Ingress correction nanosecond register **/
#define Ethernet_MAC_MACTSICNR			MMIO32(Ethernet_MAC_BASE + 0xb58)
/** Ethernet_MAC_MACTSECNR Timestamp Egress correction nanosecond register **/
#define Ethernet_MAC_MACTSECNR			MMIO32(Ethernet_MAC_BASE + 0xb5c)
/** Ethernet_MAC_MACPPSCR PPS control register **/
#define Ethernet_MAC_MACPPSCR			MMIO32(Ethernet_MAC_BASE + 0xb70)
/** Ethernet_MAC_MACPPSTTSR PPS target time seconds register **/
#define Ethernet_MAC_MACPPSTTSR			MMIO32(Ethernet_MAC_BASE + 0xb80)
/** Ethernet_MAC_MACPPSTTNR PPS target time nanoseconds register **/
#define Ethernet_MAC_MACPPSTTNR			MMIO32(Ethernet_MAC_BASE + 0xb84)
/** Ethernet_MAC_MACPPSIR PPS interval register **/
#define Ethernet_MAC_MACPPSIR			MMIO32(Ethernet_MAC_BASE + 0xb88)
/** Ethernet_MAC_MACPPSWR PPS width register **/
#define Ethernet_MAC_MACPPSWR			MMIO32(Ethernet_MAC_BASE + 0xb8c)
/** Ethernet_MAC_MACPOCR PTP Offload control register **/
#define Ethernet_MAC_MACPOCR			MMIO32(Ethernet_MAC_BASE + 0xbc0)
/** Ethernet_MAC_MACSPI0R PTP Source Port Identity 0 Register **/
#define Ethernet_MAC_MACSPI0R			MMIO32(Ethernet_MAC_BASE + 0xbc4)
/** Ethernet_MAC_MACSPI1R PTP Source port identity 1 register **/
#define Ethernet_MAC_MACSPI1R			MMIO32(Ethernet_MAC_BASE + 0xbc8)
/** Ethernet_MAC_MACSPI2R PTP Source port identity 2 register **/
#define Ethernet_MAC_MACSPI2R			MMIO32(Ethernet_MAC_BASE + 0xbcc)
/** Ethernet_MAC_MACLMIR Log message interval register **/
#define Ethernet_MAC_MACLMIR			MMIO32(Ethernet_MAC_BASE + 0xbd0)

/**@}*/


