grevaillot/svd_tools/headers/STM32H742x/ethernet_mac.h
#define Ethernet_MAC_MACLTCR_TWT_SHIFT		0
#define Ethernet_MAC_MACLTCR_TWT_MASK		0xffff
/** @defgroup ethernet_mac_macltcr_twt TWT TWT
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macletr MACLETR LPI entry timer register
@{*/


#define Ethernet_MAC_MACLETR_LPIET_SHIFT		0
#define Ethernet_MAC_MACLETR_LPIET_MASK		0x1ffff
/** @defgroup ethernet_mac_macletr_lpiet LPIET LPIET
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mac1ustcr MAC1USTCR 1-microsecond-tick counter register
@{*/


#define Ethernet_MAC_MAC1USTCR_TIC_1US_CNTR_SHIFT		0
#define Ethernet_MAC_MAC1USTCR_TIC_1US_CNTR_MASK		0xfff
/** @defgroup ethernet_mac_mac1ustcr_tic_1us_cntr TIC1USCNTR TIC_1US_CNTR
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macvr MACVR Version register
@{*/


#define Ethernet_MAC_MACVR_USERVER_SHIFT		8
#define Ethernet_MAC_MACVR_USERVER_MASK		0xff
/** @defgroup ethernet_mac_macvr_userver USERVER USERVER
@{*/
/**@}*/


#define Ethernet_MAC_MACVR_SNPSVER_SHIFT		0
#define Ethernet_MAC_MACVR_SNPSVER_MASK		0xff
/** @defgroup ethernet_mac_macvr_snpsver SNPSVER SNPSVER
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macdr MACDR Debug register
@{*/


#define Ethernet_MAC_MACDR_TFCSTS_SHIFT		17
#define Ethernet_MAC_MACDR_TFCSTS_MASK		0x03
/** @defgroup ethernet_mac_macdr_tfcsts TFCSTS TFCSTS
@{*/
/**@}*/

/** Ethernet_MAC_MACDR_TPESTS TPESTS **/
#define Ethernet_MAC_MACDR_TPESTS		(1 << 16)

#define Ethernet_MAC_MACDR_RFCFCSTS_SHIFT		1
#define Ethernet_MAC_MACDR_RFCFCSTS_MASK		0x03
/** @defgroup ethernet_mac_macdr_rfcfcsts RFCFCSTS RFCFCSTS
@{*/
/**@}*/

/** Ethernet_MAC_MACDR_RPESTS RPESTS **/
#define Ethernet_MAC_MACDR_RPESTS		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_machwf1r MACHWF1R HW feature 1 register
@{*/


#define Ethernet_MAC_MACHWF1R_L3L4FNUM_SHIFT		27
#define Ethernet_MAC_MACHWF1R_L3L4FNUM_MASK		0x0f
/** @defgroup ethernet_mac_machwf1r_l3l4fnum L3L4FNUM L3L4FNUM
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF1R_HASHTBLSZ_SHIFT		24
#define Ethernet_MAC_MACHWF1R_HASHTBLSZ_MASK		0x03
/** @defgroup ethernet_mac_machwf1r_hashtblsz HASHTBLSZ HASHTBLSZ
@{*/
/**@}*/

/** Ethernet_MAC_MACHWF1R_AVSEL AVSEL **/
#define Ethernet_MAC_MACHWF1R_AVSEL		(1 << 20)
/** Ethernet_MAC_MACHWF1R_DBGMEMA DBGMEMA **/
#define Ethernet_MAC_MACHWF1R_DBGMEMA		(1 << 19)
/** Ethernet_MAC_MACHWF1R_TSOEN TSOEN **/
#define Ethernet_MAC_MACHWF1R_TSOEN		(1 << 18)
/** Ethernet_MAC_MACHWF1R_SPHEN SPHEN **/
#define Ethernet_MAC_MACHWF1R_SPHEN		(1 << 17)
/** Ethernet_MAC_MACHWF1R_DCBEN DCBEN **/
#define Ethernet_MAC_MACHWF1R_DCBEN		(1 << 16)

#define Ethernet_MAC_MACHWF1R_ADDR64_SHIFT		14
#define Ethernet_MAC_MACHWF1R_ADDR64_MASK		0x03
/** @defgroup ethernet_mac_machwf1r_addr64 ADDR64 ADDR64
@{*/
/**@}*/

/** Ethernet_MAC_MACHWF1R_ADVTHWORD ADVTHWORD **/
#define Ethernet_MAC_MACHWF1R_ADVTHWORD		(1 << 13)
/** Ethernet_MAC_MACHWF1R_PTOEN PTOEN **/
#define Ethernet_MAC_MACHWF1R_PTOEN		(1 << 12)
/** Ethernet_MAC_MACHWF1R_OSTEN OSTEN **/
#define Ethernet_MAC_MACHWF1R_OSTEN		(1 << 11)

#define Ethernet_MAC_MACHWF1R_TXFIFOSIZE_SHIFT		6
#define Ethernet_MAC_MACHWF1R_TXFIFOSIZE_MASK		0x1f
/** @defgroup ethernet_mac_machwf1r_txfifosize TXFIFOSIZE TXFIFOSIZE
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF1R_RXFIFOSIZE_SHIFT		0
#define Ethernet_MAC_MACHWF1R_RXFIFOSIZE_MASK		0x1f
/** @defgroup ethernet_mac_machwf1r_rxfifosize RXFIFOSIZE RXFIFOSIZE
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_machwf2r MACHWF2R HW feature 2 register
@{*/


#define Ethernet_MAC_MACHWF2R_AUXSNAPNUM_SHIFT		28
#define Ethernet_MAC_MACHWF2R_AUXSNAPNUM_MASK		0x07
/** @defgroup ethernet_mac_machwf2r_auxsnapnum AUXSNAPNUM AUXSNAPNUM
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF2R_PPSOUTNUM_SHIFT		24
#define Ethernet_MAC_MACHWF2R_PPSOUTNUM_MASK		0x07
/** @defgroup ethernet_mac_machwf2r_ppsoutnum PPSOUTNUM PPSOUTNUM
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF2R_TXCHCNT_SHIFT		18
#define Ethernet_MAC_MACHWF2R_TXCHCNT_MASK		0x0f
/** @defgroup ethernet_mac_machwf2r_txchcnt TXCHCNT TXCHCNT
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF2R_RXCHCNT_SHIFT		12
#define Ethernet_MAC_MACHWF2R_RXCHCNT_MASK		0x0f
/** @defgroup ethernet_mac_machwf2r_rxchcnt RXCHCNT RXCHCNT
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF2R_TXQCNT_SHIFT		6
#define Ethernet_MAC_MACHWF2R_TXQCNT_MASK		0x0f
/** @defgroup ethernet_mac_machwf2r_txqcnt TXQCNT TXQCNT
@{*/
/**@}*/


#define Ethernet_MAC_MACHWF2R_RXQCNT_SHIFT		0
#define Ethernet_MAC_MACHWF2R_RXQCNT_MASK		0x0f
/** @defgroup ethernet_mac_machwf2r_rxqcnt RXQCNT RXQCNT
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macmdioar MACMDIOAR MDIO address register
@{*/

/** Ethernet_MAC_MACMDIOAR_PSE PSE **/
#define Ethernet_MAC_MACMDIOAR_PSE		(1 << 27)
/** Ethernet_MAC_MACMDIOAR_BTB BTB **/
#define Ethernet_MAC_MACMDIOAR_BTB		(1 << 26)

#define Ethernet_MAC_MACMDIOAR_PA_SHIFT		21
#define Ethernet_MAC_MACMDIOAR_PA_MASK		0x1f
/** @defgroup ethernet_mac_macmdioar_pa PA PA
@{*/
/**@}*/


#define Ethernet_MAC_MACMDIOAR_RDA_SHIFT		16
#define Ethernet_MAC_MACMDIOAR_RDA_MASK		0x1f
/** @defgroup ethernet_mac_macmdioar_rda RDA RDA
@{*/
/**@}*/


#define Ethernet_MAC_MACMDIOAR_NTC_SHIFT		12
#define Ethernet_MAC_MACMDIOAR_NTC_MASK		0x07
/** @defgroup ethernet_mac_macmdioar_ntc NTC NTC
@{*/
/**@}*/


#define Ethernet_MAC_MACMDIOAR_CR_SHIFT		8
#define Ethernet_MAC_MACMDIOAR_CR_MASK		0x0f
/** @defgroup ethernet_mac_macmdioar_cr CR CR
@{*/
/**@}*/

/** Ethernet_MAC_MACMDIOAR_SKAP SKAP **/
#define Ethernet_MAC_MACMDIOAR_SKAP		(1 << 4)

#define Ethernet_MAC_MACMDIOAR_GOC_SHIFT		2
#define Ethernet_MAC_MACMDIOAR_GOC_MASK		0x03
/** @defgroup ethernet_mac_macmdioar_goc GOC GOC
@{*/
/**@}*/

/** Ethernet_MAC_MACMDIOAR_C45E C45E **/
#define Ethernet_MAC_MACMDIOAR_C45E		(1 << 1)
/** Ethernet_MAC_MACMDIOAR_MB MB **/
#define Ethernet_MAC_MACMDIOAR_MB		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macmdiodr MACMDIODR MDIO data register
@{*/


#define Ethernet_MAC_MACMDIODR_RA_SHIFT		16
#define Ethernet_MAC_MACMDIODR_RA_MASK		0xffff
/** @defgroup ethernet_mac_macmdiodr_ra RA RA
@{*/
/**@}*/


#define Ethernet_MAC_MACMDIODR_MD_SHIFT		0
#define Ethernet_MAC_MACMDIODR_MD_MASK		0xffff
/** @defgroup ethernet_mac_macmdiodr_md MD MD
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca0hr MACA0HR Address 0 high register
@{*/

/** Ethernet_MAC_MACA0HR_AE AE **/
#define Ethernet_MAC_MACA0HR_AE		(1 << 31)

#define Ethernet_MAC_MACA0HR_ADDRHI_SHIFT		0
#define Ethernet_MAC_MACA0HR_ADDRHI_MASK		0xffff
/** @defgroup ethernet_mac_maca0hr_addrhi ADDRHI ADDRHI
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca0lr MACA0LR Address 0 low register
@{*/


#define Ethernet_MAC_MACA0LR_ADDRLO_SHIFT		0
#define Ethernet_MAC_MACA0LR_ADDRLO_MASK		0xffffffff
/** @defgroup ethernet_mac_maca0lr_addrlo ADDRLO ADDRLO
@{*/
/**@}*/


/**@}*/

