grevaillot/svd_tools/headers/STM32H742x/ethernet_mac.h
/** @defgroup ethernet_mac_macl4a1r MACL4A1R Layer 4 address filter 1 register
@{*/


#define Ethernet_MAC_MACL4A1R_L4DP1_SHIFT		16
#define Ethernet_MAC_MACL4A1R_L4DP1_MASK		0xffff
/** @defgroup ethernet_mac_macl4a1r_l4dp1 L4DP1 L4DP1
@{*/
/**@}*/


#define Ethernet_MAC_MACL4A1R_L4SP1_SHIFT		0
#define Ethernet_MAC_MACL4A1R_L4SP1_MASK		0xffff
/** @defgroup ethernet_mac_macl4a1r_l4sp1 L4SP1 L4SP1
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a01r MACL3A01R Layer3 address 0 filter 1 Register
@{*/


#define Ethernet_MAC_MACL3A01R_L3A01_SHIFT		0
#define Ethernet_MAC_MACL3A01R_L3A01_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a01r_l3a01 L3A01 L3A01
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a11r MACL3A11R Layer3 address 1 filter 1 register
@{*/


#define Ethernet_MAC_MACL3A11R_L3A11_SHIFT		0
#define Ethernet_MAC_MACL3A11R_L3A11_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a11r_l3a11 L3A11 L3A11
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a21r MACL3A21R Layer3 address 2 filter 1 Register
@{*/


#define Ethernet_MAC_MACL3A21R_L3A21_SHIFT		0
#define Ethernet_MAC_MACL3A21R_L3A21_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a21r_l3a21 L3A21 L3A21
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a31r MACL3A31R Layer3 address 3 filter 1 register
@{*/


#define Ethernet_MAC_MACL3A31R_L3A31_SHIFT		0
#define Ethernet_MAC_MACL3A31R_L3A31_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a31r_l3a31 L3A31 L3A31
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macarpar MACARPAR ARP address register
@{*/


#define Ethernet_MAC_MACARPAR_ARPPA_SHIFT		0
#define Ethernet_MAC_MACARPAR_ARPPA_MASK		0xffffffff
/** @defgroup ethernet_mac_macarpar_arppa ARPPA ARPPA
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactscr MACTSCR Timestamp control Register
@{*/

/** Ethernet_MAC_MACTSCR_TXTSSTSM TXTSSTSM **/
#define Ethernet_MAC_MACTSCR_TXTSSTSM		(1 << 24)
/** Ethernet_MAC_MACTSCR_CSC CSC **/
#define Ethernet_MAC_MACTSCR_CSC		(1 << 19)
/** Ethernet_MAC_MACTSCR_TSENMACADDR TSENMACADDR **/
#define Ethernet_MAC_MACTSCR_TSENMACADDR		(1 << 18)

#define Ethernet_MAC_MACTSCR_SNAPTYPSEL_SHIFT		16
#define Ethernet_MAC_MACTSCR_SNAPTYPSEL_MASK		0x03
/** @defgroup ethernet_mac_mactscr_snaptypsel SNAPTYPSEL SNAPTYPSEL
@{*/
/**@}*/

/** Ethernet_MAC_MACTSCR_TSMSTRENA TSMSTRENA **/
#define Ethernet_MAC_MACTSCR_TSMSTRENA		(1 << 15)
/** Ethernet_MAC_MACTSCR_TSEVNTENA TSEVNTENA **/
#define Ethernet_MAC_MACTSCR_TSEVNTENA		(1 << 14)
/** Ethernet_MAC_MACTSCR_TSIPV4ENA TSIPV4ENA **/
#define Ethernet_MAC_MACTSCR_TSIPV4ENA		(1 << 13)
/** Ethernet_MAC_MACTSCR_TSIPV6ENA TSIPV6ENA **/
#define Ethernet_MAC_MACTSCR_TSIPV6ENA		(1 << 12)
/** Ethernet_MAC_MACTSCR_TSIPENA TSIPENA **/
#define Ethernet_MAC_MACTSCR_TSIPENA		(1 << 11)
/** Ethernet_MAC_MACTSCR_TSVER2ENA TSVER2ENA **/
#define Ethernet_MAC_MACTSCR_TSVER2ENA		(1 << 10)
/** Ethernet_MAC_MACTSCR_TSCTRLSSR TSCTRLSSR **/
#define Ethernet_MAC_MACTSCR_TSCTRLSSR		(1 << 9)
/** Ethernet_MAC_MACTSCR_TSENALL TSENALL **/
#define Ethernet_MAC_MACTSCR_TSENALL		(1 << 8)
/** Ethernet_MAC_MACTSCR_TSADDREG TSADDREG **/
#define Ethernet_MAC_MACTSCR_TSADDREG		(1 << 5)
/** Ethernet_MAC_MACTSCR_TSUPDT TSUPDT **/
#define Ethernet_MAC_MACTSCR_TSUPDT		(1 << 3)
/** Ethernet_MAC_MACTSCR_TSINIT TSINIT **/
#define Ethernet_MAC_MACTSCR_TSINIT		(1 << 2)
/** Ethernet_MAC_MACTSCR_TSCFUPDT TSCFUPDT **/
#define Ethernet_MAC_MACTSCR_TSCFUPDT		(1 << 1)
/** Ethernet_MAC_MACTSCR_TSENA TSENA **/
#define Ethernet_MAC_MACTSCR_TSENA		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macssir MACSSIR Sub-second increment register
@{*/


#define Ethernet_MAC_MACSSIR_SSINC_SHIFT		16
#define Ethernet_MAC_MACSSIR_SSINC_MASK		0xff
/** @defgroup ethernet_mac_macssir_ssinc SSINC SSINC
@{*/
/**@}*/


#define Ethernet_MAC_MACSSIR_SNSINC_SHIFT		8
#define Ethernet_MAC_MACSSIR_SNSINC_MASK		0xff
/** @defgroup ethernet_mac_macssir_snsinc SNSINC SNSINC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macstsr MACSTSR System time seconds register
@{*/


#define Ethernet_MAC_MACSTSR_TSS_SHIFT		0
#define Ethernet_MAC_MACSTSR_TSS_MASK		0xffffffff
/** @defgroup ethernet_mac_macstsr_tss TSS TSS
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macstnr MACSTNR System time nanoseconds register
@{*/


#define Ethernet_MAC_MACSTNR_TSSS_SHIFT		0
#define Ethernet_MAC_MACSTNR_TSSS_MASK		0x7fffffff
/** @defgroup ethernet_mac_macstnr_tsss TSSS TSSS
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macstsur MACSTSUR System time seconds update register
@{*/


#define Ethernet_MAC_MACSTSUR_TSS_SHIFT		0
#define Ethernet_MAC_MACSTSUR_TSS_MASK		0xffffffff
/** @defgroup ethernet_mac_macstsur_tss TSS TSS
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macstnur MACSTNUR System time nanoseconds update register
@{*/

/** Ethernet_MAC_MACSTNUR_ADDSUB ADDSUB **/
#define Ethernet_MAC_MACSTNUR_ADDSUB		(1 << 31)

#define Ethernet_MAC_MACSTNUR_TSSS_SHIFT		0
#define Ethernet_MAC_MACSTNUR_TSSS_MASK		0x7fffffff
/** @defgroup ethernet_mac_macstnur_tsss TSSS TSSS
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactsar MACTSAR Timestamp addend register
@{*/


#define Ethernet_MAC_MACTSAR_TSAR_SHIFT		0
#define Ethernet_MAC_MACTSAR_TSAR_MASK		0xffffffff
/** @defgroup ethernet_mac_mactsar_tsar TSAR TSAR
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactssr MACTSSR Timestamp status register
@{*/


#define Ethernet_MAC_MACTSSR_ATSNS_SHIFT		25
#define Ethernet_MAC_MACTSSR_ATSNS_MASK		0x1f
/** @defgroup ethernet_mac_mactssr_atsns ATSNS ATSNS
@{*/
/**@}*/

/** Ethernet_MAC_MACTSSR_ATSSTM ATSSTM **/
#define Ethernet_MAC_MACTSSR_ATSSTM		(1 << 24)

#define Ethernet_MAC_MACTSSR_ATSSTN_SHIFT		16
#define Ethernet_MAC_MACTSSR_ATSSTN_MASK		0x0f
/** @defgroup ethernet_mac_mactssr_atsstn ATSSTN ATSSTN
@{*/
/**@}*/

/** Ethernet_MAC_MACTSSR_TXTSSIS TXTSSIS **/
#define Ethernet_MAC_MACTSSR_TXTSSIS		(1 << 15)
/** Ethernet_MAC_MACTSSR_TSTRGTERR0 TSTRGTERR0 **/
#define Ethernet_MAC_MACTSSR_TSTRGTERR0		(1 << 3)
/** Ethernet_MAC_MACTSSR_AUXTSTRIG AUXTSTRIG **/
#define Ethernet_MAC_MACTSSR_AUXTSTRIG		(1 << 2)
/** Ethernet_MAC_MACTSSR_TSTARGT0 TSTARGT0 **/
#define Ethernet_MAC_MACTSSR_TSTARGT0		(1 << 1)
/** Ethernet_MAC_MACTSSR_TSSOVF TSSOVF **/
#define Ethernet_MAC_MACTSSR_TSSOVF		(1 << 0)

/**@}*/

