grevaillot/svd_tools/headers/STM32H742x/ethernet_mac.h
/** @defgroup ethernet_mac_mactxtssnr MACTxTSSNR Tx timestamp status nanoseconds register
@{*/

/** Ethernet_MAC_MACTxTSSNR_TXTSSMIS TXTSSMIS **/
#define Ethernet_MAC_MACTxTSSNR_TXTSSMIS		(1 << 31)

#define Ethernet_MAC_MACTxTSSNR_TXTSSLO_SHIFT		0
#define Ethernet_MAC_MACTxTSSNR_TXTSSLO_MASK		0x7fffffff
/** @defgroup ethernet_mac_mactxtssnr_txtsslo TXTSSLO TXTSSLO
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactxtsssr MACTxTSSSR Tx timestamp status seconds register
@{*/


#define Ethernet_MAC_MACTxTSSSR_TXTSSHI_SHIFT		0
#define Ethernet_MAC_MACTxTSSSR_TXTSSHI_MASK		0xffffffff
/** @defgroup ethernet_mac_mactxtsssr_txtsshi TXTSSHI TXTSSHI
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macacr MACACR Auxiliary control register
@{*/

/** Ethernet_MAC_MACACR_ATSEN3 ATSEN3 **/
#define Ethernet_MAC_MACACR_ATSEN3		(1 << 7)
/** Ethernet_MAC_MACACR_ATSEN2 ATSEN2 **/
#define Ethernet_MAC_MACACR_ATSEN2		(1 << 6)
/** Ethernet_MAC_MACACR_ATSEN1 ATSEN1 **/
#define Ethernet_MAC_MACACR_ATSEN1		(1 << 5)
/** Ethernet_MAC_MACACR_ATSEN0 ATSEN0 **/
#define Ethernet_MAC_MACACR_ATSEN0		(1 << 4)
/** Ethernet_MAC_MACACR_ATSFC ATSFC **/
#define Ethernet_MAC_MACACR_ATSFC		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macatsnr MACATSNR Auxiliary timestamp nanoseconds register
@{*/


#define Ethernet_MAC_MACATSNR_AUXTSLO_SHIFT		0
#define Ethernet_MAC_MACATSNR_AUXTSLO_MASK		0x7fffffff
/** @defgroup ethernet_mac_macatsnr_auxtslo AUXTSLO AUXTSLO
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macatssr MACATSSR Auxiliary timestamp seconds register
@{*/


#define Ethernet_MAC_MACATSSR_AUXTSHI_SHIFT		0
#define Ethernet_MAC_MACATSSR_AUXTSHI_MASK		0xffffffff
/** @defgroup ethernet_mac_macatssr_auxtshi AUXTSHI AUXTSHI
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactsiacr MACTSIACR Timestamp Ingress asymmetric correction register
@{*/


#define Ethernet_MAC_MACTSIACR_OSTIAC_SHIFT		0
#define Ethernet_MAC_MACTSIACR_OSTIAC_MASK		0xffffffff
/** @defgroup ethernet_mac_mactsiacr_ostiac OSTIAC OSTIAC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactseacr MACTSEACR Timestamp Egress asymmetric correction register
@{*/


#define Ethernet_MAC_MACTSEACR_OSTEAC_SHIFT		0
#define Ethernet_MAC_MACTSEACR_OSTEAC_MASK		0xffffffff
/** @defgroup ethernet_mac_mactseacr_osteac OSTEAC OSTEAC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactsicnr MACTSICNR Timestamp Ingress correction nanosecond register
@{*/


#define Ethernet_MAC_MACTSICNR_TSIC_SHIFT		0
#define Ethernet_MAC_MACTSICNR_TSIC_MASK		0xffffffff
/** @defgroup ethernet_mac_mactsicnr_tsic TSIC TSIC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mactsecnr MACTSECNR Timestamp Egress correction nanosecond register
@{*/


#define Ethernet_MAC_MACTSECNR_TSEC_SHIFT		0
#define Ethernet_MAC_MACTSECNR_TSEC_MASK		0xffffffff
/** @defgroup ethernet_mac_mactsecnr_tsec TSEC TSEC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macppscr MACPPSCR PPS control register
@{*/


#define Ethernet_MAC_MACPPSCR_TRGTMODSEL0_SHIFT		5
#define Ethernet_MAC_MACPPSCR_TRGTMODSEL0_MASK		0x03
/** @defgroup ethernet_mac_macppscr_trgtmodsel0 TRGTMODSEL0 TRGTMODSEL0
@{*/
/**@}*/

/** Ethernet_MAC_MACPPSCR_PPSEN0 PPSEN0 **/
#define Ethernet_MAC_MACPPSCR_PPSEN0		(1 << 4)

#define Ethernet_MAC_MACPPSCR_PPSCTRL_SHIFT		0
#define Ethernet_MAC_MACPPSCR_PPSCTRL_MASK		0x0f
/** @defgroup ethernet_mac_macppscr_ppsctrl PPSCTRL PPSCTRL
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macppsttsr MACPPSTTSR PPS target time seconds register
@{*/


#define Ethernet_MAC_MACPPSTTSR_TSTRH0_SHIFT		0
#define Ethernet_MAC_MACPPSTTSR_TSTRH0_MASK		0x7fffffff
/** @defgroup ethernet_mac_macppsttsr_tstrh0 TSTRH0 TSTRH0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macppsttnr MACPPSTTNR PPS target time nanoseconds register
@{*/

/** Ethernet_MAC_MACPPSTTNR_TRGTBUSY0 TRGTBUSY0 **/
#define Ethernet_MAC_MACPPSTTNR_TRGTBUSY0		(1 << 31)

#define Ethernet_MAC_MACPPSTTNR_TTSL0_SHIFT		0
#define Ethernet_MAC_MACPPSTTNR_TTSL0_MASK		0x7fffffff
/** @defgroup ethernet_mac_macppsttnr_ttsl0 TTSL0 TTSL0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macppsir MACPPSIR PPS interval register
@{*/


#define Ethernet_MAC_MACPPSIR_PPSINT0_SHIFT		0
#define Ethernet_MAC_MACPPSIR_PPSINT0_MASK		0xffffffff
/** @defgroup ethernet_mac_macppsir_ppsint0 PPSINT0 PPSINT0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macppswr MACPPSWR PPS width register
@{*/


#define Ethernet_MAC_MACPPSWR_PPSWIDTH0_SHIFT		0
#define Ethernet_MAC_MACPPSWR_PPSWIDTH0_MASK		0xffffffff
/** @defgroup ethernet_mac_macppswr_ppswidth0 PPSWIDTH0 PPSWIDTH0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macpocr MACPOCR PTP Offload control register
@{*/


#define Ethernet_MAC_MACPOCR_DN_SHIFT		8
#define Ethernet_MAC_MACPOCR_DN_MASK		0xff
/** @defgroup ethernet_mac_macpocr_dn DN DN
@{*/
/**@}*/

/** Ethernet_MAC_MACPOCR_DRRDIS DRRDIS **/
#define Ethernet_MAC_MACPOCR_DRRDIS		(1 << 6)
/** Ethernet_MAC_MACPOCR_APDREQTRIG APDREQTRIG **/
#define Ethernet_MAC_MACPOCR_APDREQTRIG		(1 << 5)
/** Ethernet_MAC_MACPOCR_ASYNCTRIG ASYNCTRIG **/
#define Ethernet_MAC_MACPOCR_ASYNCTRIG		(1 << 4)
/** Ethernet_MAC_MACPOCR_APDREQEN APDREQEN **/
#define Ethernet_MAC_MACPOCR_APDREQEN		(1 << 2)
/** Ethernet_MAC_MACPOCR_ASYNCEN ASYNCEN **/
#define Ethernet_MAC_MACPOCR_ASYNCEN		(1 << 1)
/** Ethernet_MAC_MACPOCR_PTOEN PTOEN **/
#define Ethernet_MAC_MACPOCR_PTOEN		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macspi0r MACSPI0R PTP Source Port Identity 0 Register
@{*/


#define Ethernet_MAC_MACSPI0R_SPI0_SHIFT		0
#define Ethernet_MAC_MACSPI0R_SPI0_MASK		0xffffffff
/** @defgroup ethernet_mac_macspi0r_spi0 SPI0 SPI0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macspi1r MACSPI1R PTP Source port identity 1 register
@{*/


#define Ethernet_MAC_MACSPI1R_SPI1_SHIFT		0
#define Ethernet_MAC_MACSPI1R_SPI1_MASK		0xffffffff
/** @defgroup ethernet_mac_macspi1r_spi1 SPI1 SPI1
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macspi2r MACSPI2R PTP Source port identity 2 register
@{*/


#define Ethernet_MAC_MACSPI2R_SPI2_SHIFT		0
#define Ethernet_MAC_MACSPI2R_SPI2_MASK		0xffff
/** @defgroup ethernet_mac_macspi2r_spi2 SPI2 SPI2
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maclmir MACLMIR Log message interval register
@{*/


#define Ethernet_MAC_MACLMIR_LMPDRI_SHIFT		24
#define Ethernet_MAC_MACLMIR_LMPDRI_MASK		0xff
/** @defgroup ethernet_mac_maclmir_lmpdri LMPDRI LMPDRI
@{*/
/**@}*/


#define Ethernet_MAC_MACLMIR_DRSYNCR_SHIFT		8
#define Ethernet_MAC_MACLMIR_DRSYNCR_MASK		0x07
/** @defgroup ethernet_mac_maclmir_drsyncr DRSYNCR DRSYNCR
@{*/
/**@}*/


#define Ethernet_MAC_MACLMIR_LSI_SHIFT		0
#define Ethernet_MAC_MACLMIR_LSI_MASK		0xff
/** @defgroup ethernet_mac_maclmir_lsi LSI LSI
@{*/
/**@}*/


/**@}*/
